import React from 'react'
import { LazyLoadImage } from 'react-lazy-load-image-component';
import { useLocation, Link } from 'react-router-dom';
import img1 from '../../../assets/Main/blog/1.jpg'
import img2 from '../../../assets/Main/blog/2.jpg'
import img3 from '../../../assets/Main/blog/3.png'
import img4 from '../../../assets/Main/blog/4.jpg'
import img5 from '../../../assets/Main/blog/5.jpg'
import mem2 from '../../../assets/Main/team/2.png'

export default function BlogFocus() {
    let blogs = [
        { id: "1", img: img1, userImg: mem2, title: "أعظم سادة الشطرنج",    p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "2", img: img2, userImg: mem2, title: "الشخصيات الاجتماعية",  p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "3", img: img3, userImg: mem2, title: "إنشاء محتوى",          p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "4", img: img4, userImg: mem2, title: "لماذا الفضول مهم جدا", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "5", img: img5, userImg: mem2, title: "الخوارزميات",          p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
    ]
    const location = useLocation();
    let id = location.pathname.slice(14);
    id = id-1
    return (
        <div className='blog-focus'>
            <div className="publishDate"><span>{blogs[id].date}</span></div>
            <div className="blog-img">
                <LazyLoadImage src={blogs[id].img} alt='chess'></LazyLoadImage>
            </div>
            <div className="blog-info1">
                <div className="user">
                    <div className="img-cont"><img src={blogs[id].userImg} alt="user" /></div>
                    <span>{blogs[id].username}</span>
                </div>
                <h3>{blogs[id].title}</h3>
                <p>{blogs[id].p}</p>
                <Link to={"info/"+blogs[id].id}>قراءة المزيد</Link>
            </div>
        </div>
    )
}
