import React from 'react'
import { useLocation } from 'react-router-dom';
import img1 from '../../../assets/Main/blog/1.jpg'
import img2 from '../../../assets/Main/blog/2.jpg'
import img3 from '../../../assets/Main/blog/3.png'
import img4 from '../../../assets/Main/blog/4.jpg'
import img5 from '../../../assets/Main/blog/5.jpg'
import img6 from '../../../assets/Main/blog/6.png'
import mem2 from '../../../assets/Main/team/2.png'
import { LazyLoadImage } from 'react-lazy-load-image-component';


export default function BlogInfo() {
    let blogs = [
        { id: "1", img: img1, userImg: mem2, title: "أعظم سادة الشطرنج", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "2", img: img2, userImg: mem2, title: "الشخصيات الاجتماعية", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "3", img: img3, userImg: mem2, title: "إنشاء محتوى", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "4", img: img4, userImg: mem2, title: "لماذا الفضول مهم جدا", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
        { id: "5", img: img5, userImg: mem2, title: "الخوارزميات", p: "الشطرنج. اللعبة الاستراتيجية الكبرى. لعبة تعلم تعقيدات التخطيط الدقيق والتكتيكات. نوصي أن يكون لدى جميع الأطفال على الأقل معرفة أساسية بالشطرنج، حتى يستطيعوا على الأقل لعب بعض المباريات ضد أصدقائهم. وذلك لأن الشطرنج مفيد جداً لتنمية الدماغ وتقوية الذاكرة والتفكير الاستراتيجي والحلول الإبداعية وما شابه، ويساعد لعب الشطرنج أيضاً على فتح مسارات عصبية جديدة. حيث أُثبِتَ بالتأكيد لدى بعض أعظم لاعبي الشطرنج في العالم الذين كانوا عباقرة في اللعبة،  ", username: "أحمد عبد الله ", date: "20 يوليو " },
    ]
    const location = useLocation();
    let id = location.pathname.slice(16);
    id = id - 1
    return (
        <>
            <div className='blog-info'>
                <h2>{blogs[id].title}</h2>
                <div className="user">
                    <img src={blogs[id].userImg} alt="" />
                    <p><span>{blogs[id].username}</span> | <span>{blogs[id].date}</span></p>
                </div>
                <LazyLoadImage src={blogs[id].img} className='main-img'></LazyLoadImage>
                <h3>اللعبة الكبرى التي تجعلك قائداً</h3>
                <p>{blogs[id].p}</p>
                <LazyLoadImage src={img6} className='main-img'></LazyLoadImage>
                <p>حقق غاري كاسباروف أكبر عدد من الانتصارات المتتالية بصفته أستاذاً في لعبة الشطرنج،
وبصفته خبيراً روسياً في لعبة الشطرنج فعل الكثير لدعم هذه اللعبة. حيث لم يسافر فقط إلى بلدان مختلفة للترويج لها في أندية الشطرنج المحلية ولكنه أعار اسمه إلى سلسلة ألعاب الشطرنج على الكمبيوتر، وحتى أنه واجه جهاز كمبيوتر عملاق يسمى ديب بلو ليثبت قدرة الإنسان على التغلب على الآلة. (وثبت أنه مخطئ). في وقت مبكر من حياته المهنية، تسبب في حدوث اضطراب في عالم الشطرنج بفوزه على البطل آنذاك أناتولي كاربوف، حيث حقق كاربوف، حتى هذا الوقت، ثمانية انتصارات متتالية في البطولة السنوية، كان يُتَوقع على نطاق واسع أن يفوز للمرة التاسعة، ولكن تغلب عليه كاسباروف في المباراة النهائية الدرامية لليوم. كاسباروف هو أيضاً رجل جيد في كل مكان، فهو مدير مؤسسة حقوق الإنسان، وهي منظمة كما يمكنك أن تتخيل تهتم بالشخص الصغير، ربما سمحت له قدرته على التفكير الاستراتيجي أن يخطط بشكل صحيح للتحركات اللازمة لإبقاء حقوق الإنسان في مقدمة ومركزية العالم. كان لديه بعض الجدل في حياته المهنية عندما قام بإلغاء الصداقة مع الاتحاد الدولي للشطرنج (FIDAK إنه اختصار فرنسي على الأرجح لأنها في الأصل منظمة فرانكو)، كان هذا لأن كاسباروف شعر أن مصالح اللاعبين لم يتم تمثيلها بشكل جيد من قبل المنظمة، </p>
            </div>
        </>
    )
}
